In [1]:
# Import dependencies
import sqlite3
import pandas as pd
import numpy as np
from numpy import nan

In [2]:
# Connect to database
conn = sqlite3.connect('database.sqlite')

In [5]:
# Read sqlite query results into a pandas DataFrame
test_df = pd.read_sql_query("""
SELECT 
*
FROM east_central_table

union

SELECT 
*
FROM north_east_table

union

SELECT 
*
FROM pacific_table

union

SELECT 
*
FROM south_table

union

SELECT 
*
FROM south_east_table

union

SELECT 
*
FROM south_west_table

union

SELECT 
*
FROM west_central_table

""",conn)

test_df.head()

   index category gender    age  year      division  population
0      0   totals   Male  18-24  2013  east_central          27
1      0   totals   Male  18-24  2013  east_central          31
2      0   totals   Male  18-24  2013  east_central          55
3      0   totals   Male  18-24  2013  east_central          78
4      0   totals   Male  18-24  2014  east_central          54